app/controllers/books_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
		@bookf = Book.find(params[:id])

INSERT INTO "books" ("title", "opinion", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)
SELECT "books".* FROM "books"
---
	def create
		@book = Book.new(book_params)
		@book.user_id = current_user.id
	if  @book.save
		flash[:notice] = "posted successfully"
		redirect_to book_path(@book)
	else
		@books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "opinion" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["opinion", "I created this script as I couldn’t find any so I created one my self.\r\n\r\nalso if you need some help join my discord."], ["updated_at", "2019-02-26 17:02:52.241539"], ["id", 1]]
---
	def update
		@book = Book.find(params[:id])
		if @book.update(book_params)

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def correct_user
		@book = Book.find(params[:id])