app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @book = Book.new
    @users = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @book = Book.new
    @user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "introduction" = ?, "image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["introduction", "I created this script."], ["image_id", nil], ["updated_at", "2019-02-26 17:01:49.303607"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)